I've got some more context here. I wanted to provide a minimal example for y'all

Here is everything in a single HCL file

```hcl
terraform {
  required_providers {
    harness = {
      source  = "harness/harness"
      version = "0.37.3"
    }
  }
}

provider "harness" {
  platform_api_key = "REDACTED"
  account_id       = "vFw8OtDhTmuEJkK4xr6RhA"
}

resource "harness_platform_user" "user" {
  email = "REDACTED"
  user_groups = [
    "_account_all_users",
  ]
}
```

Then, when running the apply I see the following 

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # harness_platform_user.user will be created
  + resource "harness_platform_user" "user" {
      + disabled           = (known after apply)
      + email              = "tyler+harness5@dv01.co"
      + externally_managed = (known after apply)
      + id                 = (known after apply)
      + identifier         = (known after apply)
      + locked             = (known after apply)
      + name               = (known after apply)
      + user_groups        = [
          + "_account_all_users",
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

harness_platform_user.user: Creating...
╷
│ Error: Provider produced inconsistent result after apply
│ 
│ When applying changes to harness_platform_user.user, provider "provider[\"registry.terraform.io/harness/harness\"]" produced an unexpected new value: Root object was present, but
│ now absent.
│ 
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
```

After applying, the user's email did get an invite. When viewing the state file I see the following

```json
{
  "version": 4,
  "terraform_version": "1.9.8",
  "serial": 1,
  "lineage": "f9d36af2-28d5-841f-00f5-ebc8e42fd60f",
  "outputs": {},
  "resources": [],
  "check_results": null
}
```

Subsequent applies yield the same result. The email is no longer sent once the user accepts the invite, but nonetheless it is not in tf state
